In [1]:
import pandas as pd

list = ["Tejas","Marclus","Vedant","Aditya","Ankesh"]

# pandas.Series(data , index , dtype , copy)
series = pd.Series(list,index=[1,2,3,4,5])
print(series)
# Accessing values keywise
print(series[1])
# Accessing values indexwise
print(series[0:3])

dict = {1 : "Musk" , 2 : "Zuckerberg" , 3 : "Jack"}
series = pd.Series(dict)
print(series)

1      Tejas
2    Marclus
3     Vedant
4     Aditya
5     Ankesh
dtype: object
Tejas
1      Tejas
2    Marclus
3     Vedant
dtype: object
1          Musk
2    Zuckerberg
3          Jack
dtype: object

In [2]:
import pandas as pd
data = {"Name" : ["Tejas" , "Aditya" , "Prathamesh" , "Marclus" , "Alair"] , "Age" : [21,25,20,21,10]}
dataFrame = pd.DataFrame(data)
print(dataFrame)
print(dataFrame.max(1))

         Name  Age
0       Tejas   21
1      Aditya   25
2  Prathamesh   20
3     Marclus   21
4       Alair   10
0    21
1    25
2    20
3    21
4    10
dtype: int64

In [3]:
df = pd.DataFrame({"Numbers" : range(1,10)} , index = range(1,10))

In [4]:
df

   Numbers
1        1
2        2
3        3
4        4
5        5
6        6
7        7
8        8
9        9

In [9]:
df.set_index('ID')

    Numbers  Squares
ID
1         1        1
2         2        4
3         3        9
4         4       16
5         5       25
6         6       36
7         7       49
8         8       64
9         9       81